/**********************************************************************************
 * ¹¤³ÌÃû  :²¦´òµç»°
 * ÃèÊö    :Í¨¹ıC51¿ª·¢°å¿ØÖÆÄ£¿é²¦´òÖ¸¶¨µç»°ºÅ
 * ÊµÑéÆ½Ì¨:C51
 * ¿â°æ±¾  :


 * Ó²¼şÁ¬½ÓËµÃ÷
	 Ê¹ÓÃµ¥Æ¬´®¿ÚÓëGPRSÄ£¿éÍ¨ĞÅ 
	 C51        GPRSÄ£¿é
	 P30 (RXD)->RXD
	 P31 (TXD)->TXD
	 GND	    ->GND

 * Èí¼ş¹¦ÄÜËµÃ÷
   °å×ÓÉÏµçºóÔËĞĞÖ¸Ê¾µÆRUNING_LED»áÒÔÒ»ÃëµÄÆµÂÊÉÁË¸
	 ´ò¿ª´úÂëĞŞ¸Ä¶ÌĞÅÖĞĞÄºÅ¡¢½ÓÊÕ·½ÊÖ»úºÅºÍ¶ÌĞÅÄÚÈİ£¬±àÒë³É¹¦ºóÏÂÔØµ½µ¥Æ¬»úÀïÃæ£¬
	 ¾Í¿ÉÒÔÊµÏÖ·¢ËÍÒ»ÌõÖĞÎÄ¶ÌĞÅ£¬ÖĞÎÄ¶ÌĞÅ¾ßÌåµÄ½âÎö¿ÉÒÔ²Î¿¼´®¿Úµ÷ÊÔ±Ê¼Ç
**********************************************************************************/
#include "config.h"
#include "string.h"
#include "delay.h"
#include "uart.h"
#include "stdio.h"
#include "intrins.h"
#define Buf1_Max 200 					  //´®¿Ú2»º´æ³¤¶È
/*************	±¾µØ³£Á¿ÉùÃ÷	**************/
sbit RUNING_LED = P3^2;					//ÔËĞĞÖ¸Ê¾µÆ
sbit io=P1^0;//dht11data¶Ë½Óµ¥Æ¬»úµÄP1^0¿Ú// 

sbit rw=P3^6;//Ò»ÏÂÈıĞĞÊÇÉèÖÃlcd1602µÄÊ¹ÄÜ¶Ë// 

sbit rs=P3^5; 

sbit ep=P3^7; 

typedef bit BOOL;//´ËÉùÃ÷Ò»¸ö²¼¶ûĞÍ±äÁ¿¼´Õæ»ò¼Ù// 

unsigned char data_byte; 

unsigned char RH,RL,TH,TL; 
//code unsigned char *content="0891683108706505F011000D91683197985889F90008AA0C6D4B8BD55DF27ECF5B8C6210";//·¢ËÍ¶ÌĞÅÄÚÈİ
code unsigned char *content="0891683110900805F011000D91688146255844F50008AA144F604ED659884E86969458C176845FEB70B9505A";//·¢ËÍ¶ÌĞÅÄÚÈİ
code char buff[] ="0891683110900805F011000D91683197985889F90008AA";
code char *NumBuf[] = {"0030","0031","0032","0033","0034","0035","0036","0037","0038","0039"};
code char  *RH_TM_Buf = "5EA64E3AFF1A";
/************************¶ÌĞÅÄÚÈİ½âÎö**************************************/
/*
   //¶ÌĞÅÖĞĞÄºÅ£¨µ¹Ğò£©       Ä¿±êÊÖ»ú£¨µ¹Ğò£©             ¶ÌĞÅÄÚÈİ£¨²âÊÔÒÑ¾­Íê³É£©
     8613800756500F           8613798985989F          
0891 683108706505F0 1100 0D91 683197985889F9 0008AA   0C   6D4B8BD55DF27ECF5B8C6210
       ºÚÁú½­  683110900805F0                                            ×Ö½ÚÊı
																										 
																									14	 4F604ED659884E86969458C176845FEB70B9505A 
*/
/*************  ±¾µØ±äÁ¿ÉùÃ÷	**************/

xdata u8 Uart1_Buf[Buf1_Max];

u8 Times=0,First_Int = 0,shijian=0,Second_2s,Uart_flag;//Uart_flagÎª´¦ÀíflagÎª1 Ê±£¬Ã»´¦Àí£¬Îª0Ê±´¦Àí¹ı

bdata u8 Flag;//¶¨Ê±Æ÷±êÖ¾Î»
sbit Timer0_start =Flag^0;	//¶¨Ê±Æ÷0ÑÓÊ±Æô¶¯¼ÆÊıÆ÷



/*************	±¾µØº¯ÊıÉùÃ÷	**************/
void GPIO_config(void); //¶Ë¿Ú³õÊ¼»¯ÅäÖÃ
void Timer0Init(void);  //¶¨Ê±Æ÷0³õÊ¼»¯
void CLR_Buf1(void);    //Çå³ı´®\¿Ú2½ÓÊÕ»º´æ
u8 Find(u8 *a);         //²éÕÒ×Ö·û´®
void Second_AT_Command(u8 *b,u8 *a,u8 wait_time); //·¢ËÍATÖ¸Áîº¯Êı
void Set_Pdu_Mode(void);//ÉèÖÃ¶ÌĞÅÄ£Ê½PDU
void Wait_CREG(void);   //²éÑ¯µÈ´ıÄ£¿é×¢²á³É¹¦
void Send_Pdu_Sms(unsigned char *sms,int len);//·¢ËÍÒ»ÌõÖĞÎÄ¶ÌĞÅ
void DHT_display();
void receive();
unsigned char receive_byte();
void display(unsigned char addr,unsigned char q);
void start();
void lcd_init();
void write_byte(unsigned char dat);
void write_addr(unsigned char addr);
void write_cmd(unsigned char cmd);
BOOL lcd_bz();
void delay1();
void delay(unsigned char ms);
 void Delay1s() ;
 void Check_New_Message(void);
 void Back_Send_Sms();
void Send_Sms(char *sms,int len);

/*************  Íâ²¿º¯ÊıºÍ±äÁ¿ÉùÃ÷*****************/




/*******************************************************************************
* º¯ÊıÃû : main 
* ÃèÊö   : Ö÷º¯Êı
* ÊäÈë   : 
* Êä³ö   : 
* ·µ»Ø   : 
* ×¢Òâ   : ´®¿Ú²¨ÌØÂÊÊÇ9600£¬GPRSÄ£¿éÄ¬ÈÏ²¨ÌØÂÊÊÇ115200£¬ĞèÒª×Ô¼ºÍ¨¹ı´®¿ÚÖúÊÖĞŞ¸Ä
				   Îª9600·½¿ÉÊ¹ÓÃ¡£ 
*******************************************************************************/
void main(void)
{
	Timer0Init();  //³õÊ¼»¯¶¨Ê±Æ÷0
	//GPIO_config();
	EA=1;	//¿ª×ÜÖĞ¶Ï
	
Uart1Init();    //³õÊ¼»¯´®¿Ú9600
Wait_CREG();    //²éÑ¯µÈ´ıÄ£¿é×¢²á³É¹
	
	Send_Pdu_Sms(content,35);//·¢ËÍÒ»Ìõ¶ÌÏûÏ¢
	
	while(1)
	{
		if(Second_2s < 2)
		{
				//DHT_display();
			
		}
		if(Uart_flag == 1)
		{
		//0.	Check_New_Message();
		}
	}
	
}
/*******************************************************************************
* º¯ÊıÃû : Check_Message_rec
* ÃèÊö   : ¼ì²éÊÇ·ñÓĞĞÂĞÅÏ¢£¬²¢Ö´ĞĞĞÅÏ¢ÄÚÈİÖ¸Áî
* ÊäÈë   : 
* Êä³ö   : 
* ·µ»Ø   : 
* ×¢Òâ   : 
*******************************************************************************/

void Check_New_Message(void)
{
	u8 temp=0;
	if(strstr(Uart1_Buf,"+CMT")!=NULL)   		//Èô»º´æ×Ö·û´®ÖĞº¬ÓĞ"+CMT"¾Í±íÊ¾ÓĞĞÂµÄ¶ÌĞÅ
	{
		delay_ms(3);//µÈ´ıÊı¾İÈ«²¿½ÓÊÕÍê³É
		if(strstr(Uart1_Buf,"73AF58834FE1606F")!=NULL)//»ñÈ¡»·¾³ĞÅÏ¢
		{
		//µ÷ÓÃ·¢ËÍ¶ÌĞÅº¯Êı
			Back_Send_Sms();
		}
		else if(strstr(Uart1_Buf,"5173706F")!=NULL)//¹ØµÆ
		{
		//
		}
		else if(strstr(Uart1_Buf,"5F00706F")!=NULL)//¿ªµÆ
		{
		//
		}
   	else if(strstr(Uart1_Buf,"62535F00753598CE6247")!=NULL)//´ò¿ªµç·çÉÈ
		{
		//
		} 
		else if(strstr(Uart1_Buf,"517395ED753598CE6247")!=NULL)//´ò¿ªµç·çÉÈ
		{
		//
		} 
		CLR_Buf1();
		//Second_AT_Command("AT+CMGD=1,4","OK",3);//É¾³ı¶ÌĞÅ
	}
}


/*******************************************************************************
* º¯ÊıÃû : Uart1 
* ÃèÊö   : ´®¿Ú1ÖĞ¶Ï·şÎñÈë¿Úº¯Êı
* ÊäÈë   : 
* Êä³ö   : 
* ·µ»Ø   : 
* ×¢Òâ   : 
*******************************************************************************/
void Uart1() interrupt 4
{
    if (RI)
    {
      RI = 0;                 //Çå³ıRIÎ»
			Uart1_Buf[First_Int] = SBUF;  	  //½«½ÓÊÕµ½µÄ×Ö·û´®´æµ½»º´æÖĞ
			First_Int++;                			//»º´æÖ¸ÕëÏòºóÒÆ¶¯
			if(First_Int > Buf1_Max)       		//Èç¹û»º´æÂú,½«»º´æÖ¸ÕëÖ¸Ïò»º´æµÄÊ×µØÖ·
			{
				First_Int = 0;
			}
    }
    if (TI)
    {
        TI = 0;                 //Çå³ıTIÎ»
    }
		
}
/*******************************************************************************
* º¯ÊıÃû : Timer0_ISR
* ÃèÊö   : ¶¨Ê±Æ÷0ÖĞ¶Ï·şÎñÈë¿Úº¯Êı,20msÖĞ¶ÏÒ»´Î
* ÊäÈë   : 
* Êä³ö   : 
* ·µ»Ø   : 
* ×¢Òâ   : 
*******************************************************************************/
void Timer0_ISR() interrupt 1
{
	static u8 Time_count=0;
  TL0 = 0x00;		  //ÖØÖÃ¶¨Ê±Æ÷³õÖµ
	TH0 = 0xB8;		  //ÖØÖÃ¶¨Ê±Æ÷³õÖµ	
	TR0=0;//¹Ø¶¨Ê±Æ÷
	
	Time_count++;
	if(Time_count>=50)
	{
		Time_count = 0;
		RUNING_LED =~RUNING_LED;
	}
	
	Second_2s++;
	if(Second_2s >= 100)
	{
		Second_2s = 0;
		
	}
	
	if(count_20ms) //20msÑÓÊ±¼ÆÊıÆ÷
		count_20ms--;
	if(Timer0_start)
	Times++;
	if(Times > (50*shijian))
	{
		Timer0_start = 0;
		Times = 0;
	}
	TR0=1;//¿ª¶¨Ê±Æ÷
}
/*******************************************************************************
* º¯ÊıÃû : GPIO_config
* ÃèÊö   : IO¿ÚÅäÖÃº¯Êı
* ÊäÈë   : 
* Êä³ö   : 
* ·µ»Ø   : 
* ×¢Òâ   : 
*******************************************************************************/
void	GPIO_config(void)
{
		RUNING_LED=0;
}
/*******************************************************************************
* º¯ÊıÃû : Timer0Init
* ÃèÊö   : ¶¨Ê±Æ÷0³õÊ¼»¯£¬20ms¶¨Ê±
* ÊäÈë   : 
* Êä³ö   : 
* ·µ»Ø   : 
* ×¢Òâ   : 
*******************************************************************************/
void Timer0Init(void)		//20ºÁÃë@11.0592MHz
{
	AUXR &= 0x7F;		//¶¨Ê±Æ÷Ê±ÖÓ12TÄ£Ê½
	TMOD &= 0xF0;		//
	TMOD |= 0x01;		//ÉèÖÃ¶¨Ê±Æ÷Ä£Ê½£¬16Î»¶¨Ê±Æ÷
	TL0 = 0x00;		  //ÉèÖÃ¶¨Ê±Æ÷³õÖµ
	TH0 = 0xB8;		  //ÉèÖÃ¶¨Ê±Æ÷³õÖµ
	TF0 = 0;		    //ÇåTF0±êÖ¾
	TR0 = 1;		    //¶¨Ê±Æ÷0¿ªÊ¼¼ÆÊ±
	ET0 = 1;    	  //Ê¹ÄÜ¶¨Ê±Æ÷0ÖĞ¶Ï
}
/*******************************************************************************
* º¯ÊıÃû : CLR_Buf1
* ÃèÊö   : Çå³ı´®¿Ú2»º´æÊı¾İ
* ÊäÈë   : 
* Êä³ö   : 
* ·µ»Ø   : 
* ×¢Òâ   : 
*******************************************************************************/
void CLR_Buf1(void)
{
	u16 k;
	for(k=0;k<Buf1_Max;k++)      //½«»º´æÄÚÈİÇåÁã
	{
		Uart1_Buf[k] = 0x00;
	}
    First_Int = 0;              //½ÓÊÕ×Ö·û´®µÄÆğÊ¼´æ´¢Î»ÖÃ
	Uart_flag = 0;
}

/*******************************************************************************
* º¯ÊıÃû : Find
* ÃèÊö   : ÅĞ¶Ï»º´æÖĞÊÇ·ñº¬ÓĞÖ¸¶¨µÄ×Ö·û´®
* ÊäÈë   : 
* Êä³ö   : 
* ·µ»Ø   : unsigned char:1 ÕÒµ½Ö¸¶¨×Ö·û£¬0 Î´ÕÒµ½Ö¸¶¨×Ö·û 
* ×¢Òâ   : 
*******************************************************************************/

u8 Find(u8 *a)
{ 
  if(strstr(Uart1_Buf,a)!=NULL)
	    return 1;
	else
			return 0;
}

/*******************************************************************************
* º¯ÊıÃû : Second_AT_Command
* ÃèÊö   : ·¢ËÍATÖ¸Áîº¯Êı
* ÊäÈë   : ·¢ËÍÊı¾İµÄÖ¸Õë¡¢·¢ËÍµÈ´ıÊ±¼ä(µ¥Î»£ºS)
* Êä³ö   : 
* ·µ»Ø   : 
* ×¢Òâ   : 
*******************************************************************************/

void Second_AT_Command(u8 *b,u8 *a,u8 wait_time)         
{
	u8 i;
	u8 *c;
	c = b;										//±£´æ×Ö·û´®µØÖ·µ½c
	CLR_Buf1(); 
  i = 0;
	while(i == 0)                    
	{
		if(!Find(a))           //²éÕÒĞèÒªÓ¦´ğµÄ×Ö·û
		{
			if(Timer0_start == 0)//³¬Ê±ÖØĞÂ·¢ËÍÃüÁî
			{
				b = c;						 //½«×Ö·û´®µØÖ·¸øb
				for (b; *b!='\0';b++)
				{
					UART1_SendData(*b);
				}
				UART1_SendLR();	
				Times = 0;
				shijian = wait_time;
				Timer0_start = 1;  //¿ªÊ¼¼ÆÊ±
		   }
    }
 	  else
		{
			i = 1;
			Timer0_start = 0;  
		}
	}
	CLR_Buf1(); 
}

/*******************************************************************************
* º¯ÊıÃû : Set_Pdu_Mode
* ÃèÊö   : ÉèÖÃ¶ÌĞÅÎªPDUÎÄ±¾Ä£Ê½
* ÊäÈë   : 
* Êä³ö   : 
* ·µ»Ø   : 
* ×¢Òâ   : 
*******************************************************************************/
void Set_Pdu_Mode(void)
{
	Second_AT_Command("ATE0","OK",3);										  //È¡Ïû»ØÏÔ	
	Second_AT_Command("AT+CNMI=3,2,0,0,0","OK",3);							//ĞÂ¶ÌĞÅÖ±½ÓÊä³ö
	Second_AT_Command("AT+CMGF=0","OK",3);								//ÉèÖÃPDUÄ£Ê½	
	Second_AT_Command("AT+CPMS=\"SM\",\"SM\",\"SM\"","OK",3);//ËùÓĞ²Ù×÷¶¼ÔÚSIM¿¨ÖĞ½øĞĞ
}
/*******************************************************************************
* º¯ÊıÃû : Send_Pdu_Sms
* ÃèÊö   : ·¢ËÍPDUÎÄ±¾¶ÌĞÅ
* ÊäÈë   : 
* Êä³ö   : 
* ·µ»Ø   : 
* ×¢Òâ   : 
*******************************************************************************/
void Send_Pdu_Sms(unsigned char *sms,int len)
{
	char buf[20] = "";
	sprintf(buf,"AT+CMGS=%d",len);
	Second_AT_Command(buf,">",3); //·¢ËÍÊı¾İ³¤¶È£º27£¨¾ßÌåµÄ¼ÆËã·½·¨¿´´®¿Úµ÷ÊÔ±È½Ï£©½ÓÊÕµ½¡°>¡±²Å·¢ËÍ¶ÌĞÅÄÚÈİ
	UART1_SendString(sms);     //·¢ËÍ¶ÌĞÅÄÚÈİ
	UART1_SendData(0X1A);          //·¢ËÍ½áÊø·û
}

/*******************************************************************************
* º¯ÊıÃû : Wait_CREG
* ÃèÊö   : µÈ´ıÄ£¿é×¢²á³É¹¦
* ÊäÈë   : 
* Êä³ö   : 
* ·µ»Ø   : 
* ×¢Òâ   : 
*******************************************************************************/
void Wait_CREG(void)
{
	u8 i;
	u8 k;
	i = 0;
	CLR_Buf1();
  while(i == 0)        			
	{
		CLR_Buf1();        
		UART1_SendString("AT+CREG?");//²éÑ¯Ä£¿éÍøÂç×¢²á×´Ì¬
		UART1_SendLR();
		delay_ms(250);  						
	    for(k=0;k<Buf1_Max;k++)      			
    	{
			if(Uart1_Buf[k] == ':')
			{
				if((Uart1_Buf[k+4] == '1')||(Uart1_Buf[k+4] == '5')) //±íÃ÷ÍøÂç×¢²á³É¹¦
				{
					i = 1;
				  break;
				}
			}
		}
	}
}




/***********************************************/


 void Delay1s()                //@11.0592MHz
{
        unsigned char i, j, k;

        _nop_();
        i = 8;
        j = 1;
        k = 243;
        do
        {
                do
                {
                        while (--k);
                } while (--j);
        } while (--i);
}

//***************ÑÓÊ±º¯Êı************************************* 

 void delay(unsigned char ms) //ÑÓÊ±Ä£¿é// 

{ 

  unsigned char i; 

  while(ms--)                 

        

 for(i=0;i<100;i++); 

} 


void delay1()//Ò»¸öforÑ­»·´ó¸ÅĞèÒª8¸ö¶à»úÆ÷ÖÜÆÚª£Ò»¸ö»úÆ÷ÖÜÆÚÎª1usª¡¾§ÕñÎª12MHzª¢ª£Ò²¾ÍÊÇËµ±¾º¯ÊıÑÓÊ±8us¶àª¡´ËÑÓÊ±º¯Êı±ØĞëµÂÉÔÎ¢¾«È·Ò»µãª¢ 

{ 

  unsigned char i; 

  for(i=0;i<1;i++); 

} 

  

//***************************************************************  

//lcdÄ£¿é// 

BOOL lcd_bz()//²âÊÔlcdÃ¦Âµ×´Ì¬ª£·µ»ØÖµÎª²¼¶ûĞÍÊıÖµª£Õæ»ò¼Ùª¡'1'.'0'ª¢  

{ 

 BOOL result;
  rs=0;           // ¶ÁÃ¦ĞÅºÅ
  rw=1;
  ep=1;
  _nop_();
  _nop_();
  _nop_();
  _nop_();
  result = (BOOL)(P2&0x80);
  ep=0;
return  result ;

}     

void write_cmd(unsigned char cmd)//Ğ´Ö¸Áî// 

{ 

  while (lcd_bz());
  rs=0;
  rw=0;
  ep=0;
  _nop_();
  _nop_();
  P2=cmd ;
  _nop_();
  _nop_();
  _nop_();
  _nop_();
  ep=1;
  _nop_();
  _nop_();
  _nop_();
  _nop_();
  ep=0;

} 

 

void write_addr(unsigned char addr)//Ğ´µØÖ·// 

{ 

  write_cmd(addr|0x80);//LCDµÚÒ»ĞĞµÄÊ×µØÖ·Îª0x80ª¡µÚ¶şĞĞµÄÊ×µØÖ·Îª0x80+0x40=0xc0 

} 

 

void write_byte(unsigned char dat) //Ğ´×Ö½Ú// 

{ 

   while (lcd_bz());
  rs=1;
  rw=0;
  ep=0;
  _nop_();
  _nop_();
  P2=dat ;
  _nop_();
  _nop_();
  _nop_();
  _nop_();
  ep=1;
  _nop_();
  _nop_();
  _nop_();
  _nop_();
  ep=0;

} 

 

void lcd_init() //lcd³õÊ¼»¯// 

{ 

  write_cmd(0x38);//ÉèÖÃLCDÁ½ĞĞÏÔÊ¾ª¡Ò»¸öÊı¾İÓÉ5*7µãÕó±íÊ¾,Êı¾İÓÉ8¸úÏß´«Êä 

  delay(1); 

  write_cmd(0x0c);//Çå³ıÆÁÄ»ÏÔÊ¾ 

  delay(1); 

  write_cmd(0x06);//Éè¶¨ÊäÈë·½Ê½ª¡ÔöÁ¿²»ÒÆÎ» 

  delay(1); 

  write_cmd(0x01);//¿ªÕûÌåÏÔÊ¾ª¡¹Ø¹â±êª¡²»ÉÁË¸ 

  delay(1); 

} 

 

void display(unsigned char addr,unsigned char q)//ÔÚÄ³Ò»µØÖ·ÉÏÏÔÊ¾ÄÚÈİª¡adder±íÊ¾µÄÊÇµØÖ·Æ«ÒÆÁ¿ª¡q±íÊ¾ÏÔÊ¾µÄ×Ö·û»òÊı×Ö// 

{ 

  delay(10);   write_addr(addr); 

  write_byte(q); 

  delay(1);//ĞŞ¸Ä´ËÊ±¼äª£¿ÉÒÔ¸Ä±äLCDÉÏÊıÖµÌø±äµÄÊı¶È 

} 

 

//**************************dht11²âÊÔÄ³¿é*************************************// 

void start()//¿ªÊ¼ĞÅºÅ 

{ 

  io=1; 

  delay1(); 

  io=0; 

  delay(25);// Ö÷»ú°Ñ×ÜÏßÀ­µÍ±ØĞë´óÓÚ18msª£±£Ö¤DHT11ÄÜ¼ì²âµ½ÆğÊ¼ĞÅºÅ 

  io=1;    //·¢ËÍ¿ªÊ¼ĞÅºÅ½áÊøºóª£À­¸ßµçÆ½ÑÓÊ±20-40us 

  delay1();//ÒÔÏÂÈı¸öÑÓÊ±º¯Êı²î²»¶àÎª24usª£·ûºÏÒªÇó 

  delay1(); 

  delay1(); 

} 

 

unsigned char receive_byte()//½ÓÊÕÒ»¸ö×Ö½Ú// 

{ 

  unsigned char i,temp; 

  for(i=0;i<8;i++)//½ÓÊÕ8bitµÄÊı¾İ 

  { 

 	while(!io);//µÈ´ı50usµÄµÍµçÆ½¿ªÊ¼ĞÅºÅ½áÊø 

 	delay1();//¿ªÊ¼ĞÅºÅ½áÊøÖ®ºóª£ÑÓÊ±26us-28usª¡ÒÔÏÂÈı¸öÑÓÊ±º¯Êıª¢ 

	 delay1(); 

 	delay1(); 

 	temp=0;//Ê±¼äÎª26us-28usª£±íÊ¾½ÓÊÕµÄÎªÊı¾İ'0' 

 	if(io==1) 

	 temp=1; //Èç¹û26us-28usÖ®ºóª£»¹Îª¸ßµçÆ½ª£Ôò±íÊ¾½ÓÊÕµÄÊı¾İÎª'1' 

    while(io);//µÈ´ıÊı¾İĞÅºÅ¸ßµçÆ½ª¡'0'Îª26us-28usª£'1'Îª70usª¢ 

 	data_byte<<=1;//½ÓÊÕµÄÊı¾İÎª¸ßÎ»ÔÚÇ°ª¡ÓÒÒÆª¢ 

	 data_byte|=temp; 

  } 

  return data_byte; 

} 

    

void receive()//½ÓÊÕÊı¾İ// 

{ 

  unsigned char T_H,T_L,R_H,R_L,check,num_check,i; 

  start();//¿ªÊ¼ĞÅºÅ// 

  io=1;   //Ö÷»úÉèÎªÊäÈëª£ÅĞ¶Ï´Ó»úª¡DHT11ª¢ÏìÓ¦ĞÅºÅ 

  if(!io)//ÅĞ¶Ï´Ó»úÊÇ·ñÓĞµÍµçÆ½ÏìÓ¦ĞÅºÅ// 

  {  
	while(!io);//ÅĞ¶Ï´Ó»ú·¢³ö 80us µÄµÍµçÆ½ÏìÓ¦ĞÅºÅÊÇ·ñ½áÊø// 

	while(io);//ÅĞ¶Ï´Ó»ú·¢³ö 80us µÄ¸ßµçÆ½ÊÇ·ñ½áÊøª£Èç½áÊøÔòÖ÷»ú½øÈëÊı¾İ½ÓÊÕ×´Ì¬ 

	R_H=receive_byte();//Êª¶È¸ßÎ» 

 	R_L=receive_byte();//Êª¶ÈµÍÎ» 

	T_H=receive_byte();//ÎÂ¶È¸ßÎ» 

	T_L=receive_byte();//ÎÂ¶ÈµÍÎ» 

	check=receive_byte();//Ğ£ÑéÎ» 

	io=0; //µ±×îºóÒ»bitÊı¾İ½ÓÍê±Ïºóª£´Ó»úÀ­µÍµçÆ½50us// 

	for(i=0;i<7;i++)//²î²»¶à50usµÄÑÓÊ± 

	delay1(); 

	io=1;//×ÜÏßÓÉÉÏÀ­µç×èÀ­¸ßª£½øÈë¿ÕÏĞ×´Ì¬ 

	num_check=R_H+R_L+T_H+T_L; 

	if(num_check==check)//ÅĞ¶Ï¶Áµ½µÄËÄ¸öÊı¾İÖ®ºÍÊÇ·ñÓëĞ£ÑéÎ»ÏàÍ¬ 

 	{ 

   RH=R_H; 

   RL=R_L; 

   TH=T_H; 

   TL=T_L; 

   check=num_check; 

 	} 

  } 

} 

//*****************************************************************************

 

void DHT_display()//Ö÷º¯ÊıÄ£¿é// 

{ 

  lcd_init();//³õÊ¼»¯LCD 

  while(1) 

  { Delay1s();Delay1s();

    receive();//½ÓÊÕÊı¾İ 

 



 display(0x00,RH/10+0x30); //0x30±íÊ¾ª¤´ø×Ö¿âµÄLCD1602ÖĞ0x30µÄÎ»ÖÃ·ÅÓĞÊı×Ö0ª¡RH/10+0x30¼´±íÊ¾Êª¶ÈµÄÊ®Î»Êı×ÖÔÚ×Ö¿âRH/10+0x30µÄÎ»ÖÃ´¦·Å×Åª¢ 

 display(0x01,RH%10+0x30); 

 display(0X03,'%'); 


 display(0X04,'/'); 
 display(0x42-0x3d,TH/10+0x30); 

 display(0x43-0x3d,TH%10+0x30); 

 display(0x44-0x3d,0xdf);//ÒÔÏÂÁ½¸öÊÇÎÂ¶Èµ¥Î»µÄ´¦Àí 

 display(0x45-0x3d,0x43); 

  } 
} 


void Back_Send_Sms()
{
	
	xdata char buf[200]="";
	sprintf(buf,"%s6E7F%s%s%s6E29%s",buff,RH_TM_Buf,NumBuf[RH/10],NumBuf[RH%10],RH_TM_Buf);
	Send_Sms(buf,strlen(buf)-18);
}

void Send_Sms(char *sms,int len)
{
	xdata char buf[12]="";
	sprintf(buf,"AT+CMGS=%d",len);
	Second_AT_Command(buf,">",3); //·¢ËÍÊı¾İ³¤¶È£º27£¨¾ßÌåµÄ¼ÆËã·½·¨¿´´®¿Úµ÷ÊÔ±È½Ï£©½ÓÊÕµ½¡°>¡±²Å·¢ËÍ¶ÌĞÅÄÚÈİ
	UART1_SendString(sms);     //·¢ËÍ¶ÌĞÅÄÚÈİ
	UART1_SendData(0X1A);          //·¢ËÍ½áÊø·û
}